// Соответствия URL и новых заголовков h1, title, description и rel="canonical"
var pageData = {
  "https://newbornk.com/collections/women/%D0%9B%D0%B5%D0%B3%D1%96%D0%BD%D1%81%D0%B8": {
    h1: "Брендові жіночі леггінсі",
    title: "Купити жіночі леггінсі в Україні: кращі дизайнери | NEWBORN K",
    description: "Брендові жіночі леггінсі за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%9B%D0%B5%D0%B3%D1%96%D0%BD%D1%81%D0%B8" // Замените на нужный URL
  },
  "https://newbornk.com/collections/men/%D0%A8%D0%BE%D1%80%D1%82%D0%B8": {
    h1: "Брендові чоловічі шорти",
    title: "Купити чоловічі шорті в Україні: кращі дизайнери | NEWBORN K",
    description: "чоловічі шорти за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A8%D0%BE%D1%80%D1%82%D0%B8" // Замените на нужный URL
  },
"https://newbornk.com/collections/men/%D0%91%D1%96%D0%BB%D0%B8%D0%B7%D0%BD%D0%B0": {
    h1: "Брендова чоловіча білизна",
    title: "Брендова чоловіча білизна в Україні: кращі дизайнери | NEWBORN K",
    description: "Брендова чоловіча білизна за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%91%D1%96%D0%BB%D0%B8%D0%B7%D0%BD%D0%B0" // Замените на нужный URL
  },
 "https://newbornk.com/collections/men/%D0%90%D0%BA%D1%81%D0%B5%D1%81%D1%83%D0%B0%D1%80%D0%B8": {
    h1: "Брендові чоловічи аксесуари",
    title: "Брендові чоловічи аксесуари, купити дизайнерські аксесуари для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи аксесуари за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%90%D0%BA%D1%81%D0%B5%D1%81%D1%83%D0%B0%D1%80%D0%B8" // Замените на нужный URL
  }, 
 "https://newbornk.com/collections/men/%D0%A4%D1%83%D1%82%D0%B1%D0%BE%D0%BB%D0%BA%D0%B8": {
    h1: "Брендові чоловічи футболки",
    title: "Брендові чоловічи футболки, купити дизайнерські футболки для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи футболки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A4%D1%83%D1%82%D0%B1%D0%BE%D0%BB%D0%BA%D0%B8" // Замените на нужный URL
  }, 
  "https://newbornk.com/collections/men/%D0%A8%D1%82%D0%B0%D0%BD%D0%B8": {
    h1: "Брендові чоловічи штани",
    title: "Брендові чоловічи штани, купити дизайнерські штани для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи штани за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A8%D1%82%D0%B0%D0%BD%D0%B8" // Замените на нужный URL
  }, 
   "https://newbornk.com/collections/men/%D0%A5%D1%83%D0%B4%D1%96": {
    h1: "Брендові чоловічи худі",
    title: "Брендові чоловічи худі, купити дизайнерські худі для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи худі за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A5%D1%83%D0%B4%D1%96" // Замените на нужный URL
  }, 
     "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "Брендові чоловічи сорочки",
    title: "Брендові чоловічи сорочки, купити дизайнерські сорочки для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи сорочки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  }, 
       "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "Брендові чоловічи cвітшоти",
    title: "Брендові чоловічи cвітшоти, купити дизайнерські cвітшоти для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи cвітшоти за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  }, 
         "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "Брендові чоловічи светри",
    title: "Брендові чоловічи светри, купити дизайнерські светри для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи светри за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  }, 
           "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "Брендові чоловічи пальта",
    title: "Брендові чоловічи пальта, купити дизайнерські пальта для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи пальта за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%BF%D0%B0%D0%BB%D1%8C%D1%82%D0%B0" // Замените на нужный URL
  }, 
           "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8": {
    h1: "Брендові чоловічи лонгсліви",
    title: "Брендові чоловічи лонгсліви, купити дизайнерські лонгсліви для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи лонгсліви за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%A1%D0%BE%D1%80%D0%BE%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  }, 
            "https://newbornk.com/collections/men/%D0%9A%D1%83%D1%80%D1%82%D0%BA%D0%B8": {
    h1: "Брендові чоловічи куртки",
    title: "Брендові чоловічи куртки, купити дизайнерські куртки для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи куртки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%9A%D1%83%D1%80%D1%82%D0%BA%D0%B8" // Замените на нужный URL
  }, 
    "https://newbornk.com/collections/%D0%BA%D0%BE%D0%BC%D0%B1%D1%96%D0%BD%D0%B5%D0%B7%D0%BE%D0%BD%D0%B8/%D0%9A%D0%BE%D0%BC%D0%B1%D1%96%D0%BD%D0%B5%D0%B7%D0%BE%D0%BD%D0%B8": {
    h1: "Брендові чоловічи комбінезони",
    title: "Брендові чоловічи комбінезони, купити дизайнерські комбінезони для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи комбінезони за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/%D0%BA%D0%BE%D0%BC%D0%B1%D1%96%D0%BD%D0%B5%D0%B7%D0%BE%D0%BD%D0%B8/%D0%9A%D0%BE%D0%BC%D0%B1%D1%96%D0%BD%D0%B5%D0%B7%D0%BE%D0%BD%D0%B8" // Замените на нужный URL
  }, 
       "https://newbornk.com/collections/men/%D0%BA%D1%96%D0%BC%D0%BE%D0%BD%D0%BE": {
    h1: "Брендові чоловічи кімоно",
    title: "Брендові чоловічи кімоно, купити дизайнерські кімоно для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи кімоно за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%BA%D1%96%D0%BC%D0%BE%D0%BD%D0%BE" // Замените на нужный URL
  },       
         "https://newbornk.com/collections/men/%D0%96%D0%B8%D0%BB%D0%B5%D1%82%D0%B8": {
    h1: "Брендові чоловічи жилети",
    title: "Брендові чоловічи жилети, купити дизайнерські жилети для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи жилети за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%96%D0%B8%D0%BB%D0%B5%D1%82%D0%B8" // Замените на нужный URL
  },  
          "https://newbornk.com/collections/men/%D0%94%D0%BE%D1%89%D0%BE%D0%B2%D0%B8%D0%BA%D0%B8": {
    h1: "Брендові чоловічи дощовики",
    title: "Брендові чоловічи дощовики, купити дизайнерські дощовики для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи дощовики за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%94%D0%BE%D1%89%D0%BE%D0%B2%D0%B8%D0%BA%D0%B8" // Замените на нужный URL
  },  
            "https://newbornk.com/collections/men/%D0%B4%D0%B5%D0%BD%D1%96%D0%BC": {
    h1: "Брендові чоловічий денім",
    title: "Брендові чоловічий денім, купити дизайнерський денім для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічий денім за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%B4%D0%B5%D0%BD%D1%96%D0%BC" // Замените на нужный URL
  },  
            "https://newbornk.com/collections/men/%D0%BF%D0%BE%D0%BB%D0%BE": {
    h1: "Брендові чоловічи футболки поло",
    title: "Брендові чоловічи футболки поло, купити дизайнерські футболки поло для чоловіків в Україні | NEWBORN K",
    description: "Брендові чоловічи футболки поло за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men/%D0%BF%D0%BE%D0%BB%D0%BE" // Замените на нужный URL
  },  
  
  
  "https://newbornk.com/collections/men": {
    h1: "Брендовий чоловічий одяг",
    title: "Брендовий чоловічий одяг, купити дизайнерський одяг для чоловіків в Україні | NEWBORN K",
    description: "Брендовий чоловічий одяг за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/men" // Замените на нужный URL
  },
  
    "https://newbornk.com/collections/women": {
    h1: "Брендовий жіночий одяг",
    title: "Брендовий жіночий одяг, купити дизайнерський одяг для жінок в Україні | NEWBORN K",
    description: "Брендовий жіночий одяг за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women" // Замените на нужный URL
  },
 "https://newbornk.com/collections/women/%D0%91%D1%96%D0%BB%D0%B8%D0%B7%D0%BD%D0%B0": {
    h1: "Брендова жіноча білизна",
    title: "Брендова жіноча білизна в Україні: кращі дизайнери | NEWBORN K",
    description: "Брендова жіноча білизна за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%91%D1%96%D0%BB%D0%B8%D0%B7%D0%BD%D0%B0" // Замените на нужный URL
  },  
            "https://newbornk.com/collections/women/%D0%A8%D1%82%D0%B0%D0%BD%D0%B8": {
    h1: "Брендові жіночі штани",
    title: "Брендові жіночі штани, купити дизайнерські штани для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі штани за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A8%D1%82%D0%B0%D0%BD%D0%B8" // Замените на нужный URL
  },  
             "https://newbornk.com/collections/women/%D0%A8%D0%BE%D1%80%D1%82%D0%B8": {
    h1: "Брендові жіночі шорти",
    title: "Брендові жіночі шорти, купити дизайнерські шорти для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі шорти за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A8%D0%BE%D1%80%D1%82%D0%B8" // Замените на нужный URL
  },   
               "https://newbornk.com/collections/women/%D0%A5%D1%83%D0%B4%D1%96": {
    h1: "Брендові жіночі худі",
    title: "Брендові жіночі худі, купити дизайнерські худі для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі худі за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A5%D1%83%D0%B4%D1%96" // Замените на нужный URL
  },  
               "https://newbornk.com/collections/women/%D0%A4%D1%83%D1%82%D0%B1%D0%BE%D0%BB%D0%BA%D0%B8": {
    h1: "Брендові жіночі футболки",
    title: "Брендові жіночі футболки, купити дизайнерські футболки для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі футболки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A4%D1%83%D1%82%D0%B1%D0%BE%D0%BB%D0%BA%D0%B8" // Замените на нужный URL
  },  
               "https://newbornk.com/collections/women/%D0%A2%D0%BE%D0%BF%D0%B8": {
    h1: "Брендові жіночі топи",
    title: "Брендові жіночі топи, купити дизайнерські топи для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі топи за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A2%D0%BE%D0%BF%D0%B8" // Замените на нужный URL
  },     
                "https://newbornk.com/collections/women/%D0%9A%D1%83%D1%80%D1%82%D0%BA%D0%B8+%D0%96%D1%96%D0%BD%D0%BE%D1%87%D0%B5": {
    h1: "Брендові жіночі куртки",
    title: "Брендові жіночі куртки, купити дизайнерські куртки для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі куртки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%9A%D1%83%D1%80%D1%82%D0%BA%D0%B8+%D0%96%D1%96%D0%BD%D0%BE%D1%87%D0%B5" // Замените на нужный URL
  },   
   "https://newbornk.com/collections/women/%D0%BA%D1%96%D0%BC%D0%BE%D0%BD%D0%BE": {
    h1: "Брендові жіночі кімоно",
    title: "Брендові жіночі кімоно, купити дизайнерські кімоно для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі кімоно за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%BA%D1%96%D0%BC%D0%BE%D0%BD%D0%BE" // Замените на нужный URL
  },   
     "https://newbornk.com/collections/women/%D0%96%D0%B8%D0%BB%D0%B5%D1%82%D0%B8": {
    h1: "Брендові жіночі жилети",
    title: "Брендові жіночі жилети, купити дизайнерські жилети для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі жилети за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%96%D0%B8%D0%BB%D0%B5%D1%82%D0%B8" // Замените на нужный URL
  },   
     "https://newbornk.com/collections/women/%D0%A1%D1%83%D0%BA%D0%BD%D1%96": {
    h1: "Брендові жіночі сукні",
    title: "Брендові жіночі сукні, купити дизайнерські сукні для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі сукні за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D1%83%D0%BA%D0%BD%D1%96" // Замените на нужный URL
  },   
       "https://newbornk.com/collections/women/%D0%A1%D1%83%D0%BA%D0%BD%D1%96": {
    h1: "Брендові жіночі сорочки",
    title: "Брендові жіночі сорочки, купити дизайнерські сорочки для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі сорочки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D1%83%D0%BA%D0%BD%D1%96" // Замените на нужный URL
  },
  
         "https://newbornk.com/collections/women/%D0%A1%D0%B2%D1%96%D1%82%D1%88%D0%BE%D1%82%D0%B8": {
    h1: "Брендові жіночі cвітшоти",
    title: "Брендові жіночі cвітшоти, купити дизайнерські cвітшоти для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі cвітшоти за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D0%B2%D1%96%D1%82%D1%88%D0%BE%D1%82%D0%B8" // Замените на нужный URL
  },
           "https://newbornk.com/collections/women/%D0%A1%D0%B2%D0%B5%D1%82%D1%80%D0%B8": {
    h1: "Брендові жіночі светри",
    title: "Брендові жіночі светри, купити дизайнерські светри для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі светри за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D0%B2%D0%B5%D1%82%D1%80%D0%B8" // Замените на нужный URL
  },
            "https://newbornk.com/collections/women/%D0%A1%D0%BF%D1%96%D0%B4%D0%BD%D0%B8%D1%86%D1%96": {
    h1: "Брендові жіночі спідниці",
    title: "Брендові жіночі спідниці, купити дизайнерські спідниці для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі спідниці за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%A1%D0%BF%D1%96%D0%B4%D0%BD%D0%B8%D1%86%D1%96" // Замените на нужный URL
  }, 
             "https://newbornk.com/collections/women/%D0%9B%D0%BE%D0%BD%D0%B3%D1%81%D0%BB%D1%96%D0%B2%D0%B8": {
    h1: "Брендові жіночі лонгсліви",
    title: "Брендові жіночі лонгсліви, купити дизайнерські лонгсліви для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі лонгсліви за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%9B%D0%BE%D0%BD%D0%B3%D1%81%D0%BB%D1%96%D0%B2%D0%B8" // Замените на нужный URL
  }, 
              "https://newbornk.com/collections/women/%D0%91%D0%BE%D0%B4%D1%96": {
    h1: "Брендові жіночі боді",
    title: "Брендові жіночі боді, купити дизайнерські боді для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі боді за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%91%D0%BE%D0%B4%D1%96" // Замените на нужный URL
  },   
             "https://newbornk.com/collections/women/%D0%90%D0%BA%D1%81%D0%B5%D1%81%D1%83%D0%B0%D1%80%D0%B8": {
    h1: "Брендові жіночі аксесуари",
    title: "Брендові жіночі аксесуари, купити дизайнерські аксесуари для жінок в Україні | NEWBORN K",
    description: "Брендові жіночі аксесуари за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/women/%D0%90%D0%BA%D1%81%D0%B5%D1%81%D1%83%D0%B0%D1%80%D0%B8" // Замените на нужный URL
  },   
  
  
             "https://newbornk.com/collections/accessoires/%D0%B1%D0%B0%D0%BD%D0%B4%D0%B0%D0%BD%D0%B8": {
    h1: "Брендові бандани",
    title: "Брендові бандани, купити дизайнерські бандани в Україні | NEWBORN K",
    description: "Брендові бандани за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%B1%D0%B0%D0%BD%D0%B4%D0%B0%D0%BD%D0%B8" // Замените на нужный URL
  },  
  
               "https://newbornk.com/collections/accessoires/%D0%91%D0%B0%D0%BB%D0%B0%D0%BA%D0%BB%D0%B0%D0%B2%D0%B8": {
    h1: "Брендові балаклави",
    title: "Брендові балаклави, купити дизайнерські балаклави в Україні | NEWBORN K",
    description: "Брендові балаклави за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%91%D0%B0%D0%BB%D0%B0%D0%BA%D0%BB%D0%B0%D0%B2%D0%B8" // Замените на нужный URL
  },
               "https://newbornk.com/collections/accessoires/%D0%93%D0%B0%D0%BC%D0%B0%D0%BD%D1%86%D1%96": {
    h1: "Брендові гаманці",
    title: "Брендові гаманці, купити дизайнерські гаманці в Україні | NEWBORN K",
    description: "Брендові гаманці за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%93%D0%B0%D0%BC%D0%B0%D0%BD%D1%86%D1%96" // Замените на нужный URL
  },
                 "https://newbornk.com/collections/accessoires/%D0%B3%D0%BE%D0%B4%D0%B8%D0%BD%D0%BD%D0%B8%D0%BA": {
    h1: "Брендові годинники",
    title: "Брендові годинники, купити дизайнерські годинники в Україні | NEWBORN K",
    description: "Брендові годинники за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%B3%D0%BE%D0%B4%D0%B8%D0%BD%D0%BD%D0%B8%D0%BA" // Замените на нужный URL
  },
  "https://newbornk.com/collections/%D0%BC%D0%B0%D1%81%D0%BA%D0%B8/%D0%9C%D0%B0%D1%81%D0%BA%D0%B8": {
    h1: "Брендові маски",
    title: "Брендові маски, купити дизайнерські маски в Україні | NEWBORN K",
    description: "Брендові маски за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/%D0%BC%D0%B0%D1%81%D0%BA%D0%B8/%D0%9C%D0%B0%D1%81%D0%BA%D0%B8" // Замените на нужный URL
  },
  "https://newbornk.com/collections/accessoires/%D0%9A%D0%B5%D0%BF%D0%BA%D0%B8": {
    h1: "Брендові кепки",
    title: "Брендові кепки, купити дизайнерські кепки в Україні | NEWBORN K",
    description: "Брендові кепки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%9A%D0%B5%D0%BF%D0%BA%D0%B8" // Замените на нужный URL
  }, 
  
   "https://newbornk.com/collections/accessoires/%D0%9F%D0%B0%D0%BD%D0%B0%D0%BC%D0%B8": {
    h1: "Брендові панами",
    title: "Брендові панами, купити дизайнерські панами в Україні | NEWBORN K",
    description: "Брендові панами за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%9F%D0%B0%D0%BD%D0%B0%D0%BC%D0%B8" // Замените на нужный URL
  }, 
     "https://newbornk.com/collections/%D0%BE%D1%87%D0%BA%D0%B8/%D0%9E%D0%BA%D1%83%D0%BB%D1%8F%D1%80%D0%B8": {
    h1: "Брендові окуляри",
    title: "Брендові окуляри, купити дизайнерські окуляри в Україні | NEWBORN K",
    description: "Брендові окуляри за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/%D0%BE%D1%87%D0%BA%D0%B8/%D0%9E%D0%BA%D1%83%D0%BB%D1%8F%D1%80%D0%B8" // Замените на нужный URL
  }, 
       "https://newbornk.com/collections/accessoires/%D0%A0%D0%B5%D0%BC%D0%B5%D0%BD%D1%96": {
    h1: "Брендові ремені",
    title: "Брендові ремені, купити дизайнерські ремені в Україні | NEWBORN K",
    description: "Брендові ремені за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A0%D0%B5%D0%BC%D0%B5%D0%BD%D1%96" // Замените на нужный URL
  }, 
        "https://newbornk.com/collections/accessoires/%D0%A0%D1%8E%D0%BA%D0%B7%D0%B0%D0%BA%D0%B8": {
    h1: "Брендові рюкзаки",
    title: "Брендові рюкзаки, купити дизайнерські рюкзаки в Україні | NEWBORN K",
    description: "Брендові рюкзаки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A0%D1%8E%D0%BA%D0%B7%D0%B0%D0%BA%D0%B8" // Замените на нужный URL
  },  
          "https://newbornk.com/collections/accessoires/%D0%A0%D1%83%D0%BA%D0%B0%D0%B2%D0%B8%D1%87%D0%BA%D0%B8": {
    h1: "Брендові рукавички",
    title: "Брендові рукавички, купити дизайнерські рукавички в Україні | NEWBORN K",
    description: "Брендові рукавички за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A0%D1%83%D0%BA%D0%B0%D0%B2%D0%B8%D1%87%D0%BA%D0%B8" // Замените на нужный URL
  },  
           "https://newbornk.com/collections/accessoires/%D0%A1%D1%83%D0%BC%D0%BA%D0%B8": {
    h1: "Брендові сумки",
    title: "Брендові сумки, купити дизайнерські сумки в Україні | NEWBORN K",
    description: "Брендові сумки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A1%D1%83%D0%BC%D0%BA%D0%B8" // Замените на нужный URL
  },   
           "https://newbornk.com/collections/accessoires/%D0%A8%D0%B0%D0%BF%D0%BA%D0%B8": {
    h1: "Брендові шапки",
    title: "Брендові шапки, купити дизайнерські шапки в Україні | NEWBORN K",
    description: "Брендові шапки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A8%D0%B0%D0%BF%D0%BA%D0%B8" // Замените на нужный URL
  },     
           "https://newbornk.com/collections/accessoires/%D0%A8%D0%B0%D1%80%D1%84%D0%B8": {
    h1: "Брендові шарфи",
    title: "Брендові шарфи, купити дизайнерські шарфи в Україні | NEWBORN K",
    description: "Брендові шарфи за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A8%D0%B0%D1%80%D1%84%D0%B8" // Замените на нужный URL
  },    
            "https://newbornk.com/collections/accessoires/%D0%A8%D0%BA%D0%B0%D1%80%D0%BF%D0%B5%D1%82%D0%BA%D0%B8": {
    h1: "Брендові шкарпетки",
    title: "Брендові шкарпетки, купити дизайнерські шкарпетки в Україні | NEWBORN K",
    description: "Брендові шкарпетки за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%A8%D0%BA%D0%B0%D1%80%D0%BF%D0%B5%D1%82%D0%BA%D0%B8" // Замените на нужный URL
  },    
             "https://newbornk.com/collections/accessoires/%D0%AE%D0%B2%D0%B5%D0%BB%D1%96%D1%80%D0%BA%D0%B0": {
    h1: "Брендові ювелірні вироби",
    title: "Брендові ювелірні вироби, купити дизайнерські ювелірні вироби в Україні | NEWBORN K",
    description: "Брендові ювелірні вироби за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%AE%D0%B2%D0%B5%D0%BB%D1%96%D1%80%D0%BA%D0%B0" // Замените на нужный URL
  }, 
             "https://newbornk.com/collections/lifestyle/%D0%9A%D0%B8%D0%BB%D0%B8%D0%BC%D0%B8": {
    h1: "Брендові килими",
    title: "Брендові килими, купити дизайнерські килими в Україні | NEWBORN K",
    description: "Брендові килими за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/lifestyle/%D0%9A%D0%B8%D0%BB%D0%B8%D0%BC%D0%B8" // Замените на нужный URL
  },  
             "https://newbornk.com/collections/accessoires/%D0%94%D0%BE%D0%B3%D0%BB%D1%8F%D0%B4-%D0%B7%D0%B0-%D0%B2%D0%B7%D1%83%D1%82%D1%82%D1%8F%D0%BC": {
    h1: "Засоби для догляду за взуттям",
    title: "Засоби для догляду за взуттям купити в Україні | NEWBORN K",
    description: "Засоби для догляду за взуттям за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%94%D0%BE%D0%B3%D0%BB%D1%8F%D0%B4-%D0%B7%D0%B0-%D0%B2%D0%B7%D1%83%D1%82%D1%82%D1%8F%D0%BC" // Замените на нужный URL
  },  
             "https://newbornk.com/collections/accessoires/%D0%9A%D0%B0%D0%BF%D0%BE%D1%80": {
    h1: "Дизайнерський капор",
    title: "капор, купити дизайнерський капор в Україні | NEWBORN K",
    description: "капор за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires/%D0%9A%D0%B0%D0%BF%D0%BE%D1%80" // Замените на нужный URL
  },  
            "https://newbornk.com/collections/lifestyle": {
    h1: "LIFESTYLE",
    title: "Дизайнерські речі в Україні | NEWBORN K",
    description: "Дизайнерські речі за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/lifestyle" // Замените на нужный URL
  }, 
  
              "https://newbornk.com/collections/sale": {
    h1: "Розпродаж",
    title: "речі зі знижкою, купити дизайнерські речі за найкращою ціною | NEWBORN K",
    description: "речі зі знижкою ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/sale" // Замените на нужный URL
  }, 
                "https://newbornk.com/collections/vzuttya": {
    h1: "Брендове жіноче та чоловіче взуття",
    title: "Брендове жіноче та чоловіче взуття, купити дизайнерське взуття в Україні | NEWBORN K",
    description: "Брендове жіноче та чоловіче взуття за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/vzuttya" // Замените на нужный URL
  }, 
                 "https://newbornk.com/collections/accessoires": {
    h1: "Дизайнерські аксесуари",
    title: "Дизайнерські аксесуари, купити аксесуари в Україні | NEWBORN K",
    description: "Дизайнерські аксесуари за найкращою ціною ❰❰NEWBORN K❱❱. Видатні дизайнери світу та України. Досконала якість! 📦 Доставка по Україні 💫Даруйте собі впевненість з нашими речами!",
    canonicalURL: "https://newbornk.com/collections/accessoires" // Замените на нужный URL
  }, 

};

// Функция для замены заголовка h1, title, description и rel="canonical" при полном совпадении URL страницы
function replaceMetaTags() {
  var currentURL = window.location.href;
  var metaTags = pageData[currentURL];

  if (metaTags) {
    var h1Element = document.querySelector("h1");
    var titleElement = document.querySelector("title");
    var metaDescriptionElement = document.querySelector('meta[name="description"]');
    var canonicalElement = document.querySelector('link[rel="canonical"]');

    if (h1Element) {
      h1Element.innerText = metaTags.h1;
    }

    if (titleElement) {
      titleElement.innerText = metaTags.title;
    }

    if (metaDescriptionElement) {
      metaDescriptionElement.setAttribute("content", metaTags.description);
    }

    if (canonicalElement) {
      canonicalElement.setAttribute("href", metaTags.canonicalURL);
    }
  }
}

document.addEventListener("DOMContentLoaded", replaceMetaTags);
